# Данные для улиц
streets = {
    "Улица Щетинкина": {
        "markers": [
            {"name": 'Проективное покрытие: 60%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок', "coords": [53.718503, 91.444637]},
            {"name": 'Проективное покрытие: 50%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок', "coords": [53.719195, 91.44444]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок", "coords": [53.721958, 91.443528]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 5 см<br/>Почва: Легкий суглинок', "coords": [53.72311, 91.443088]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.723316, 91.442943]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.719864, 91.444278]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок', "coords": [53.723641, 91.442863]},
            {"name": "Проективное покрытие: 60%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.724527, 91.44266]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок", "coords": [53.726095, 91.442138]},
            {"name": 'Проективное покрытие: 30%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок', "coords": [53.733403, 91.440291]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок", "coords": [53.72639, 91.442279]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.726778, 91.442095]},
            {"name": 'Проективное покрытие: 40%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок', "coords": [53.728001, 91.441852]},
            {"name": "Проективное покрытие: 60%<br/>Высота газона: 6 см<br/>Почва: Легкий суглинок", "coords": [53.728537, 91.441666]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок", "coords": [53.728927, 91.441489]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 5 см<br/>Почва: Легкий суглинок', "coords": [53.729375, 91.441349]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок", "coords": [53.729631, 91.441326]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.730208, 91.441166]},
            {"name": 'Проективное покрытие: 60%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок', "coords": [53.730732, 91.440973]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.732075, 91.440609]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.734712, 91.439852]},

            {"name": 'Проективное покрытие: 100%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок', "coords": [53.717647, 91.445158]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 7 см<br/>Почва: Легкий суглинок", "coords": [53.718163, 91.445271]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.718610, 91.445244]},
            {"name": 'Проективное покрытие: 90%<br/>Высота газона: 5 см<br/>Почва: Легкий суглинок', "coords": [53.719983, 91.444639]},
            {"name": "Проективное покрытие: 100%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.721045, 91.444195]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.721353, 91.444081]},
            {"name": 'Проективное покрытие: 70%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок', "coords": [53.721641, 91.443956]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.722021, 91.443862]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок", "coords": [53.722553, 91.443728]},
            {"name": 'Проективное покрытие: 30%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок', "coords": [53.722873, 91.44358]},
            {"name": "Проективное покрытие: 20%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.723211, 91.443494]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок", "coords": [53.723485, 91.443392]},
            {"name": 'Проективное покрытие: 90%<br/>Высота газона: 5 см<br/>Почва: Легкий суглинок', "coords": [53.72379, 91.443329]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок", "coords": [53.722873, 91.44358]},
            {"name": "Проективное покрытие: 90%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок", "coords": [53.724078, 91.443227]},
            {"name": "Проективное покрытие: 80%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.724323, 91.443133]}, # т
            {"name": "Проективное покрытие: 50%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.724638, 91.443094]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок", "coords": [53.724907, 91.442985]},
            {"name": 'Проективное покрытие: 20%<br/>Высота газона: -5 см<br/>Почва: Легкий суглинок', "coords": [53.725287, 91.442875]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.725875, 91.442734]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.726135, 91.442671]},
            {"name": 'Проективное покрытие: 60%<br/>Высота газона: 5 см<br/>Почва: Легкий суглинок', "coords": [53.726751, 91.442491]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок", "coords": [53.727261, 91.442327]},
            {"name": "Проективное покрытие: 50%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок", "coords": [53.727716, 91.442225]},
            {"name": 'Проективное покрытие: 80%<br/>Высота газона: 4 см<br/>Почва: Легкий суглинок', "coords": [53.728161, 91.442092]},
            {"name": "Проективное покрытие: 100%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок", "coords": [53.728803, 91.441927]},
            {"name": "Проективное покрытие: 70%<br/>Высота газона: 2 см<br/>Почва: Легкий суглинок", "coords": [53.729604, 91.441653]},
            {"name": "Проективное покрытие: 30%<br/>Высота газона: -4 см<br/>Почва: Легкий суглинок", "coords": [53.730119, 91.441606]},
            {"name": "Проективное покрытие: 40%<br/>Высота газона: -3 см<br/>Почва: Легкий суглинок", "coords": [53.731046, 91.441324]},
            {"name": 'Проективное покрытие: 70%<br/>Высота газона: 3 см<br/>Почва: Легкий суглинок', "coords": [53.733742, 91.440565]},
        ],
        "line": [
            [53.726186, 91.44252],
            [53.734935, 91.43993],
            [53.733805, 91.440309],
            [53.727508, 91.442126],
            [53.7248349, 91.442895],
            [53.724819, 91.442882],
            [53.722302, 91.44362],
            [53.717319, 91.445112],
        ],
        "htmlcode": '''<h1>Улица Щетинкина</h1>
              <img src="img/2.jpg" width="300px" height="200px">''',
    },
    "Проспект Ленина": {
        "markers": [
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7212, 91.4335]},  # правые
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -6 см.<br/>Почва: Средний суглинок", "coords": [53.7212, 91.4338]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7212, 91.4341]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7213, 53.7213]},
            {"name": "Проективное покрытие: 40 %<br/>Высота газона: -7 см.<br/>Почва: Средний суглинок", "coords": [53.7213, 91.4351]},
            {"name": "Проективное покрытие: 40 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7214, 91.4354]},
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: 4 см.<br/>Почва: Средний суглинок", "coords": [53.7215, 91.4368]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 1 см.<br/>Почва: Средний суглинок", "coords": [53.7216, 91.4378]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7217, 91.4388]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7218, 91.4397]},
            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7219, 91.4406]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7220, 91.4416]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 4 см.<br/>Почва: Средний суглинок", "coords": [53.7221, 91.4422]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.<br/>Почва: Средний суглинок", "coords": [53.7221, 91.4430]},
            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7222, 91.4440]},
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7223, 91.4450]},
            {"name": "Проективное покрытие: 40 %<br/>Высота газона: -2 см.<br/>Почва: Средний суглинок", "coords": [53.7224, 91.4454]},
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [91.4454, 91.4472]},
            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7227, 91.4483]},
            {"name": "Проективное покрытие: 20 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7228, 91.4490]},
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7228, 91.4497]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7229, 91.4507]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: 4 см.<br/>Почва: Средний суглинок", "coords": [53.7230, 91.4515]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7230, 91.4531]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 1 см.<br/>Почва: Средний суглинок", "coords": [53.7231, 91.4543]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 1 см.<br/>Почва: Средний суглинок", "coords": [53.7232, 91.4549]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7233, 91.4551]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7233, 91.4555]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7234, 91.4560]},

            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7213, 91.4336]},  # левые
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7214, 91.4343]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7214, 91.4347]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7215, 91.4354]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7215, 91.4362]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7216, 91.4371]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7217, 91.4379]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.<br/>Почва: Средний суглинок", "coords": [53.7218, 91.4391]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7219, 91.4399]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7220, 91.4412]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7221, 91.4421]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7222, 91.4428]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7223, 91.4434]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7223, 91.4443]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7224, 91.4450]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7225, 91.4458]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7226, 91.4465]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.<br/>Почва: Средний суглинок", "coords": [53.7226, 91.4472]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7227, 91.4481]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7228, 91.4488]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7228, 91.4494]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7229, 91.4502]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7230, 91.4510]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7230, 91.4517]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7231, 91.4531]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7231, 91.4535]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7234, 91.4553]},
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7234, 91.4557]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.<br/>Почва: Средний суглинок", "coords": [53.7233, 91.4546]},
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.<br/>Почва: Средний суглинок", "coords": [53.7231, 91.4523]},
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7230, 91.4507]},
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -3 см.<br/>Почва: Средний суглинок", "coords": [53.7228, 91.4492]},
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7225, 91.4462]},
        ],
        "line": [
            [53.7211, 91.4333],
            [53.722755, 91.4495],
            [53.723056, 91.4539],
            [53.7234, 91.4565],
            [53.7236, 91.4564],
            [53.7232, 91.4539],
            [53.7231, 91.4515],
            [53.7229, 91.4495],
            [53.7223, 91.4437],
            [53.7220, 91.4403],
            [53.7213, 91.4332]
        ],
        "htmlcode": '''<h1>Проспект Ленина</h1>
              <img src="img/3.jpg" width="300px" height="200px">''',
    },
    "Улица Чертыгашева": {
        "markers": [
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 6 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723926, 91.432816]},
            # левая
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723793, 91.432967]},
            # правая
            {"name": "Проективное покрытие: 40%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723968, 91.433600]},
            # левая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723867, 91.433619]},
            # правая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724026, 91.433724]},
            # левая
            {"name": "Проективное покрытие: 40%<br/>Высота бордюра: -4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723907, 91.433865]},
            # правая
            {"name": "Проективное покрытие: 30%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724010, 91.434258]},
            # левая
            {"name": "Проективное покрытие: 10%<br/>Высота бордюра: -7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723824, 91.434272]},
            # правая
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724143, 91.435016]},
            # левая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: -7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.723951, 91.435049]},
            # правая
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 10 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724446, 91.436218]},
            # левая
            {"name": "Проективное покрытие: 60%<br/>Высота бордюра: -5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724095, 91.436245]},
            # правая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: 8 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724339, 91.436532]},
            # левая
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: -4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724142, 91.436613]},
            # правая
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 15 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724468, 91.436938]},
            # левая
            {"name": "Проективное покрытие: 40%<br/>Высота бордюра: -7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724131, 91.436850]},
            # правая
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 7 см<br/>Почва: Средний суглинок", "coords": [53.724434, 91.437265]},
            # левая
            {"name": "Проективное покрытие: 10%<br/>Высота бордюра: -7 см<br/>Почва: Средний суглинок", "coords": [53.724199, 91.437370]},
            # правая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: 9 см<br/>Почва: Средний суглинок", "coords": [53.724485, 91.438124]},
            # левая
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: -5 см<br/>Почва: Средний суглинок", "coords": [53.724310, 91.438194]},
            # правая

            {"name": "Проективное покрытие: 60%<br/>Высота бордюра: -4 см<br/>Почва: Средний суглинок", "coords": [53.724638, 91.439293]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: -6 см<br/>Почва: Средний суглинок", "coords": [53.724462, 91.439404]},
            {"name": "Проективное покрытие: 80%<br/>Высота бордюра: 4 см<br/>Почва: Средний суглинок", "coords": [53.724572, 91.439603]},
            {"name": "Проективное покрытие: 40%<br/>Высота бордюра: -3 см<br/>Почва: Средний суглинок", "coords": [53.724515, 91.439631]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 2 см<br/>Почва: Средний суглинок", "coords": [53.724950, 91.442659]},
            {"name": "Проективное покрытие: 30%<br/>Высота бордюра: -6 см<br/>Почва: Средний суглинок", "coords": [53.724772, 91.442666]},
            {"name": "Проективное покрытие: 50%<br/>Высота бордюра: -4 см<br/>Почва: Средний суглинок", "coords": [53.724966, 91.442750]},
            {"name": "Проективное покрытие: 20%<br/>Высота бордюра: -7 см<br/>Почва: Средний суглинок", "coords": [53.724702, 91.442616]},
            {"name": "Проективное покрытие: 40%<br/>Высота бордюра: 4 см<br/>Почва: Средний суглинок", "coords": [53.724955, 91.443219]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 4 см<br/>Почва: Средний суглинок", "coords": [53.724825, 91.443264]},
            {"name": "Проективное покрытие: 30%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725025, 91.443959]},
            {"name": "Проективное покрытие: 80%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724888, 91.443972]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725100, 91.444946]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724951, 91.444818]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 11 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725098, 91.445130]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.724988, 91.445106]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725162, 91.445565]},
            {"name": "Проективное покрытие: 80%<br/>Высота бордюра: 6 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725015, 91.445608]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725181, 91.445869]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725067, 91.445907]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 9 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725280, 91.446607]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725138, 91.446636]},
            {"name": "Проективное покрытие: 80%<br/>Высота бордюра: 6 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725304, 91.447108]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 6 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725200, 91.447135]},
            {"name": "Проективное покрытие: 60%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725387, 91.447934]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725252, 91.447969]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725443, 91.448402]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725307, 91.448461]},
            {"name": "Проективное покрытие: 80%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725469, 91.448361]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725298, 91.448423]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725481, 91.448819]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725280, 91.448881]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725590, 91.449318]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725405, 91.449374]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725533, 91.449595]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725430, 91.449627]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 10 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725773, 91.452006]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725610, 91.452078]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 6 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725860, 91.452837]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725745, 91.452912]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 7 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725921, 91.453387]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725789, 91.453432]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 10 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725956, 91.453797]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725789, 91.453835]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.726074, 91.454678]},
            {"name": "Проективное покрытие: 100%<br/>Высота бордюра: 4 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725893, 91.454764]},
            {"name": "Проективное покрытие: 70%<br/>Высота бордюра: 2 см<br/>Почва: Тяжёлый суглинок", "coords": [53.726249, 91.454985]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725919, 91.455089]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 3 см<br/>Почва: Тяжёлый суглинок", "coords": [53.726153, 91.455264]},
            {"name": "Проективное покрытие: 90%<br/>Высота бордюра: 5 см<br/>Почва: Тяжёлый суглинок", "coords": [53.725964, 91.455302]}
        ],
        "line": [
            [53.723808, 91.432518],
            [53.724108, 91.435558],
            [53.724206, 91.436697],
            [53.724223, 91.436802],
            [53.724372, 91.437974],
            [53.724412, 91.438316],
            [53.724660, 91.440872],
            [53.724754, 91.441700],
            [53.724843, 91.442738],
            [53.724854, 91.442893],
            [53.724857, 91.442936],
            [53.725037, 91.445045],
            [53.725465, 91.449354],
            [53.725606, 91.450948],
            [53.725824, 91.453085],
            [53.725840, 91.453251],
            [53.725965, 91.454592],
            [53.726027, 91.455169],
        ],
        "htmlcode": '''<h1>Улица Чертыгашева</h1>
              <img src="img/4.jpg" width="300px" height="200px">''',
    },
    "Улица Крылова": {
        "markers": [
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -4 см.<br/>Почва: Средний суглинок", "coords": [53.7351, 91.4405]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 4 см.<br/>Почва: Средний суглинок", "coords": [53.7349, 91.4405]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7352, 91.4412]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7350, 91.4413]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 4 см.<br/>Почва: Средний суглинок", "coords": [53.7352, 91.4418]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 5 см.<br/>Почва: Средний суглинок", "coords": [53.7350, 91.4418]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7353, 91.4424]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7351, 91.4424]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7353, 91.4433]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Средний суглинок", "coords": [53.7352, 91.4433]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: 1 см.<br/>Почва: Средний суглинок", "coords": [53.7354, 91.4446]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 2 см.<br/>Почва: Средний суглинок", "coords": [53.7353, 91.4446]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 2 см.<br/>Почва: Легкий суглинок", "coords": [53.7355, 91.4451]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 4 см.<br/>Почва: Легкий суглинок", "coords": [53.7353, 91.4451]}, # п
            {"name": "Проективное покрытие: 40 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7355, 91.4457]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7354, 91.4458]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -2 см.<br/>Почва: Легкий суглинок", "coords": [53.7355, 91.4457]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.<br/>Почва: Легкий суглинок", "coords": [53.7354, 91.4458]}, # п
            {"name": "Проективное покрытие: 30 %<br/>Высота газона: -4 см.<br/>Почва: Легкий суглинок", "coords": [53.7356, 91.4461]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 3 см.<br/>Почва: Легкий суглинок", "coords": [53.7354, 91.4462]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7357, 91.4468]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -2 см.<br/>Почва: Легкий суглинок", "coords": [53.7355, 91.4468]}, # п
            {"name": "Проективное покрытие: 50 %<br/>Высота газона: 2 см.<br/>Почва: Легкий суглинок", "coords": [53.7357, 91.4473]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Легкий суглинок", "coords": [53.7355, 91.4474]}, # п
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 1 см.<br/>Почва: Легкий суглинок", "coords": [53.7358, 91.4479]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -1 см.<br/>Почва: Легкий суглинок", "coords": [53.7356, 91.4480]}, # п
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7358, 91.4485]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: 3 см.<br/>Почва: Легкий суглинок", "coords": [53.7357, 91.4486]}, # п
            {"name": "Проективное покрытие: 10 %<br/>Высота газона: -5 см.<br/>Почва: Легкий суглинок", "coords": [53.7359, 91.4491]}, # л
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 2 см.<br/>Почва: Легкий суглинок", "coords": [53.7357, 91.4492]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: 2 см.<br/>Почва: Легкий суглинок", "coords": [53.7359,  91.4495]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7357,  91.4496]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -4 см.<br/>Почва: Легкий суглинок", "coords": [53.7359,  91.4499]}, # л
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -4 см.<br/>Почва: Легкий суглинок", "coords": [53.7358,  91.4503]}, # п
            {"name": "Проективное покрытие: 60 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7360,  91.4503]}, # л
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -2 см.<br/>Почва: Легкий суглинок", "coords": [53.7359,  91.4516]}, # п
            {"name": "Проективное покрытие: 70 %<br/>Высота газона: -5 см.<br/>Почва: Легкий суглинок", "coords": [53.7361,  91.4511]}, # л
            {"name": "Проективное покрытие: 90 %<br/>Высота газона: 3 см.<br/>Почва: Легкий суглинок", "coords": [53.7360,  91.4519]}, # п
            {"name": "Проективное покрытие: 80 %<br/>Высота газона: -3 см.<br/>Почва: Легкий суглинок", "coords": [53.7361,  91.4516]}, # л
            {"name": "Проективное покрытие: 100 %<br/>Высота газона: 3 см.<br/>Почва: Легкий суглинок", "coords": [53.7362,  91.4521]}, # л
        ],
        "line": [
            [53.7350, 91.4400],
            [53.7352, 91.4429],
            [53.7353, 91.4441],
            [53.7360, 91.4519],
        ],
        "htmlcode": '''<h1>Улица Крылова</h1>
              <img src="img/1.jpg" width="300px" height="200px">''',
    }
}